using System;

namespace BaseHandler_Base_
{
    internal class Program
    {
        static void Main(string[] args)
        {
            BaseHandler bill200 = new Handle200();// מופע של 200
            BaseHandler bill100 = new handle100();// מופע של 100
            BaseHandler bill50 = new Handle50();// מופע של 50
            BaseHandler bill20 = new Handle20(); // מופע של 20

            bill200.SetNext(bill100); // 100 אם לא הצלחת לטפל תעביר את הבקשה להבא 
            bill100.SetNext(bill50); //  50 אם לא הצלחת לטפל תעביר את הבקשה להבא 
            bill50.SetNext(bill20); //   20 אם לא הצלחת לטפל תעביר את הבקשה להבא
            bill20.SetNext(null); //  אם לא הצלחת לטפל תעביר את הבקשה להבא (אין מכיוון שאחרי 20 אין שטר יותר קטן

            bill200.HandleRequest(770); // זו הדרך לבקש סכום כספי דרך האנדל ריקווסט
            //אפשר לבקש דרך ביל 100 וביל 50 וביל 20 אבל אחרי ביל 20 לא ינתן דבר 
            Console.WriteLine("---------------------- 20 bill ------------------------");
            // דוגמה לביל 20
            bill20.HandleRequest(750);
            // לדוגמה פה ביקשנו 100 דולר והוא יתן לנו 5 שטרות של 20 דולר 
            // אם היינו מבקשים סכום עם שארית למשל 750 הוא היה מעגל כלפיי מעלה או מטה מכיוון שעשינו את המשתנה שלנו אינטג'ר 
            Console.WriteLine("---------------------- 20 bill ------------------------");

            bill20.HandleRequest(750); // פה הוא נתן לנו סכום של 740 דולר מכיוון שהוא מעגל את המספר 
            //כי אין באפשרותו לתת לנו 750 דולר אם נעשה את החישוב 37*20 אז יצא לנו 740 במקום 750 כי נשאר יתרה שהוא לא יכול לתת
            // עקב הבקשה שלנו לסכום 750
            Console.WriteLine("---------------------- 20 bill ------------------------");
            bill20.HandleRequest(10);
            //פה למשל הוא לא יתן לנו דבר כי אין באפשרותו לתת לנו שטר של 10 כי הוא לא קיים
        }
    }
}
